Revit 2027 API
FamilyInstance.HasModifiedGeometry Method
Identifies if the geometry of this FamilyInstance has been modified from the automatically generated default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasModifiedGeometry()
Public Function HasModifiedGeometry As Boolean
public:
bool HasModifiedGeometry()
member HasModifiedGeometry : unit -> bool
Return Value
Boolean
Remarks
This method returns true if the geometry has been modified from post-processing activity in Revit such as joining, cutting, coping, extension, adaptive component modification, or other similar activity.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace